# Pandas
- ref: http://shop.oreilly.com/product/0636920034919.do

In [1]:
import pandas as pd
pd.__version__

'0.23.4'

In [2]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
data['b']

0.5

We can also use dictionary-like Python expressions and methods to examine the keys/indices and values:

In [4]:
'a' in data

True

In [5]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

Series objects can even be modified with a dictionary-like syntax. Just as you can extend a dictionary by assigning to a new key, you can extend a Series by assigning to a new index value:

In [7]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [9]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [10]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [11]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [12]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

### Indexers: loc, iloc, and ix

In [13]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [14]:
# explicit index when indexing
data[1]

'a'

In [15]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

First, the loc attribute allows indexing and slicing that always references the explicit index:

In [18]:
data

1    a
3    b
5    c
dtype: object

In [25]:
data.loc[1]

'a'

In [21]:
data.loc[1:3]

1    a
3    b
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit Python-style index:

In [23]:
data.iloc[1]

'b'

In [26]:
data.loc[1:3]

1    a
3    b
dtype: object

In [27]:
data.iloc[1:3]

3    b
5    c
dtype: object

A third indexing attribute, ix, is a hybrid of the two, and for Series objects is equivalent to standard []-based indexing. The purpose of the ix indexer will become more apparent in the context of DataFrame objects, which we will discuss in a moment.

One guiding principle of Python code is that "explicit is better than implicit." The explicit nature of loc and iloc make them very useful in maintaining clean and readable code; especially in the case of integer indexes, I recommend using these both to make code easier to read and understand, and to prevent subtle bugs due to the mixed indexing/slicing convention.

## Data Selection in DataFrame
Recall that a DataFrame acts in many ways like a two-dimensional or structured array, and in other ways like a dictionary of Series structures sharing the same index. These analogies can be helpful to keep in mind as we explore data selection within this structure.

### DataFrame as a dictionary

In [28]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [32]:
area = pd.Series({'California': 32423, 'Texas': 234234,
                  'New York': 4234, 'Florida': 42345,
                  'Illinois': 242352})

In [33]:
area

California     32423
Texas         234234
New York        4234
Florida        42345
Illinois      242352
dtype: int64

In [34]:
area.shape

(5,)

In [35]:
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})

In [36]:
pop

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [37]:
pop.shape

(5,)

In [38]:
data = pd.DataFrame({'area':area, 'pop':pop})

In [39]:
data

              area       pop
California   32423  38332521
Texas       234234  26448193
New York      4234  19651127
Florida      42345  19552860
Illinois    242352  12882135

In [40]:
data.shape

(5, 2)

In [41]:
data.area is data['area']

True

Though this is a useful shorthand, keep in mind that it does not work for all cases! For example, if the column names are not strings, or if the column names conflict with methods of the DataFrame, this attribute-style access is not possible. For example, the DataFrame has a pop() method, so data.pop will point to this rather than the "pop" column:

In [42]:
data.pop is data['pop']

False

In [43]:
data['density'] = data['pop'] / data['area']
data

              area       pop      density
California   32423  38332521  1182.263239
Texas       234234  26448193   112.913552
New York      4234  19651127  4641.267596
Florida      42345  19552860   461.751328
Illinois    242352  12882135    53.154647

### DataFrame as two-dimensional array

In [44]:
data.values

array([[3.24230000e+04, 3.83325210e+07, 1.18226324e+03],
       [2.34234000e+05, 2.64481930e+07, 1.12913552e+02],
       [4.23400000e+03, 1.96511270e+07, 4.64126760e+03],
       [4.23450000e+04, 1.95528600e+07, 4.61751328e+02],
       [2.42352000e+05, 1.28821350e+07, 5.31546470e+01]])

In [45]:
data.T

           California         Texas      New York       Florida      Illinois
area     3.242300e+04  2.342340e+05  4.234000e+03  4.234500e+04  2.423520e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  1.182263e+03  1.129136e+02  4.641268e+03  4.617513e+02  5.315465e+01

In [46]:
data.values[0]

array([3.24230000e+04, 3.83325210e+07, 1.18226324e+03])

In [47]:
data.iloc[:3, :2]

              area       pop
California   32423  38332521
Texas       234234  26448193
New York      4234  19651127

In [48]:
data.loc[:'Illinois', :'pop']

              area       pop
California   32423  38332521
Texas       234234  26448193
New York      4234  19651127
Florida      42345  19552860
Illinois    242352  12882135

In [49]:
# The ix indexer allows a hybrid of these two approaches:
data.ix[:3, :'pop']

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

              area       pop
California   32423  38332521
Texas       234234  26448193
New York      4234  19651127

In [50]:
data.loc[data.density > 100, ['pop', 'density']]

                 pop      density
California  38332521  1182.263239
Texas       26448193   112.913552
New York    19651127  4641.267596
Florida     19552860   461.751328

In [51]:
data

              area       pop      density
California   32423  38332521  1182.263239
Texas       234234  26448193   112.913552
New York      4234  19651127  4641.267596
Florida      42345  19552860   461.751328
Illinois    242352  12882135    53.154647

In [52]:
data['Florida':'Illinois']

            area       pop     density
Florida    42345  19552860  461.751328
Illinois  242352  12882135   53.154647

In [53]:
data[1:3]

            area       pop      density
Texas     234234  26448193   112.913552
New York    4234  19651127  4641.267596

In [54]:
data[data.density > 100]

              area       pop      density
California   32423  38332521  1182.263239
Texas       234234  26448193   112.913552
New York      4234  19651127  4641.267596
Florida      42345  19552860   461.751328

### Index Preservation

In [56]:
import numpy as np
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [57]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [58]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [59]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

### Index alignment in SeriesÂ¶

In [60]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [61]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [62]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [64]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

In [65]:
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

If using NaN values is not the desired behavior, the fill value can be modified using appropriate object methods in place of the operators. For example, calling A.add(B) is equivalent to calling A + B, but allows optional explicit specification of the fill value for any elements in A or B that might be missing:

In [67]:
A.add(B)

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [68]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index alignment in DataFrame

A similar type of alignment takes place for both columns and indices when performing operations on DataFrames:

In [69]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [70]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [71]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

Notice that indices are aligned correctly irrespective of their order in the two objects, and indices in the result are sorted. As was the case with Series, we can use the associated object's arithmetic method and pass any desired fill_value to be used in place of missing entries. Here we'll fill with the mean of all values in A (computed by first stacking the rows of A):

In [76]:
A.stack()

0  A     1
   B    11
1  A     5
   B     1
dtype: int64

In [77]:
A.stack().mean()

4.5

In [78]:
A.mean()

A    3.0
B    6.0
dtype: float64

In [79]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

### Operations Between DataFrame and SeriesÂ¶

In [80]:
A = rng.randint(10, size=(3, 4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [81]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [82]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [83]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

Note that these DataFrame/Series operations, like the operations discussed above, will automatically align indices between the two elements:

In [84]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int64

In [85]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN